export interface IComments {
    name: string;
    date: string;
    comment: string
}

export const comments: IComments[] = [{name: 'Sherjan  I', date: '18 авг. 2023 г.', comment: 'Я узнал много нового об управлении проектами. Профессор преподает очень четко, и я все понял. Большое спасибо Coursera за такой хороший курс.'}, {name: 'Japeth R E', date: '04, июл, 2023', comment: 'Четкий и информативный. Подчеркивается использование правильных шаблонов и артефактов. Я работаю в PM уже много лет, и эти основные вещи никто не делает. Рад, что вы подчеркиваете, что если вы профессиональный PM, это те вещи и способы, которыми вы делаете вещи.' }]