import { FC } from "react";

import Container from "@mui/material/Container";

const PrivacyPolicy: FC = () => {
  return (
    <Container>
      <div>
        <h1>Политика в отношении обработки персональных данных</h1>
        <p>
          1. ОБЩИЕ ПОЛОЖЕНИЯ
          <br />
          Настоящая политика обработки персональных данных составлена в
          соответствии с требованиями Федерального закона от 27.07.2006. №152-ФЗ
          «О персональных данных» (далее - Закон о персональных данных) и
          определяет порядок обработки персональных данных и меры по обеспечению
          безопасности персональных данных, предпринимаемые Timeoneproject
          (далее – Оператор).
          <br />
          1.1. Оператор ставит своей важнейшей целью и условием осуществления
          своей деятельности соблюдение прав и свобод человека и гражданина при
          обработке его персональных данных, в том числе защиты прав на
          неприкосновенность частной жизни, личную и семейную тайну.
          <br />
          1.2. Настоящая политика Оператора в отношении обработки персональных
          данных (далее – Политика) применяется ко всей информации, которую
          Оператор может получить о посетителях веб-сайта https://
          timeoneproject.com .<br />
          <br />
          2. ОСНОВНЫЕ ПОНЯТИЯ, ИСПОЛЬЗУЕМЫЕ В ПОЛИТИКЕ
          <br />
          2.1. Автоматизированная обработка персональных данных – обработка
          персональных данных с помощью средств вычислительной техники.
          <br />
          2.2. Блокирование персональных данных – временное прекращение
          обработки персональных данных (за исключением случаев, если обработка
          необходима для уточнения персональных данных).
          <br />
          2.3. Веб-сайт – совокупность графических и информационных материалов,
          а также программ для ЭВМ и баз данных, обеспечивающих их доступность в
          сети интернет по сетевому адресу https:// timeoneproject.com.com .
          <br />
          2.4. Информационная система персональных данных — совокупность
          содержащихся в базах данных персональных данных, и обеспечивающих их
          обработку информационных технологий и технических средств.
          <br />
          2.5. Обезличивание персональных данных — действия, в результате
          которых невозможно определить без использования дополнительной
          информации принадлежность персональных данных конкретному Пользователю
          или иному субъекту персональных данных.
          <br />
          2.6. Обработка персональных данных – любое действие (операция) или
          совокупность действий (операций), совершаемых с использованием средств
          автоматизации или без использования таких средств с персональными
          данными, включая сбор, запись, систематизацию, накопление, хранение,
          уточнение (обновление, изменение), извлечение, использование, передачу
          (распространение, предоставление, доступ), обезличивание,
          блокирование, удаление, уничтожение персональных данных.
          <br />
          2.7. Оператор – государственный орган, муниципальный орган,
          юридическое или физическое лицо, самостоятельно или совместно с
          другими лицами организующие и (или) осуществляющие обработку
          персональных данных, а также определяющие цели обработки персональных
          данных, состав персональных данных, подлежащих обработке, действия
          (операции), совершаемые с персональными данными.
          <br />
          2.8. Персональные данные – любая информация, относящаяся прямо или
          косвенно к определенному или определяемому Пользователю веб-сайта
          https:// timeoneproject.com.com .<br />
          2.9. Персональные данные, разрешенные субъектом персональных данных
          для распространения, - персональные данные, доступ неограниченного
          круга лиц к которым предоставлен субъектом персональных данных путем
          дачи согласия на обработку персональных данных, разрешенных субъектом
          персональных данных для распространения в порядке, предусмотренном
          Законом о персональных данных (далее - персональные данные,
          разрешенные для распространения).
          <br />
          2.10. Пользователь – любой посетитель веб-сайта https://
          timeoneproject.com.com .<br />
          2.11. Предоставление персональных данных – действия, направленные на
          раскрытие персональных данных определенному лицу или определенному
          кругу лиц.
          <br />
          2.12. Распространение персональных данных – любые действия,
          направленные на раскрытие персональных данных неопределенному кругу
          лиц (передача персональных данных) или на ознакомление с персональными
          данными неограниченного круга лиц, в том числе обнародование
          персональных данных в средствах массовой информации, размещение в
          информационно-телекоммуникационных сетях или предоставление доступа к
          персональным данным каким-либо иным способом.
          <br />
          2.13. Трансграничная передача персональных данных – передача
          персональных данных на территорию иностранного государства органу
          власти иностранного государства, иностранному физическому или
          иностранному юридическому лицу.
          <br />
          2.14. Уничтожение персональных данных – любые действия, в результате
          которых персональные данные уничтожаются безвозвратно с невозможностью
          дальнейшего восстановления содержания персональных данных в
          информационной системе персональных данных и (или) уничтожаются
          материальные носители персональных данных.
        </p>

        <h2>3. ОБЩИЕ ПОЛОЖЕНИЯ</h2>

        <p>
          3.1. Настоящая Политика обработки персональных данных (далее -
          Политика) применяется к всей информации, которую Оператор может
          получить о Пользователе во время использования сайта https://
          timeoneproject.com.com .
        </p>

        <h2>4. ОСНОВНЫЕ ПРИНЦИПЫ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>

        <p>
          4.1. Обработка персональных данных осуществляется на законной и
          справедливой основе.
        </p>
        <p>
          4.2. Обработка персональных данных ограничивается достижением
          конкретных, заранее определенных и законных целей. Не допускается
          обработка персональных данных, несовместимая с целями сбора
          персональных данных.
        </p>
        <p>
          4.3. Не допускается объединение баз данных, содержащих персональные
          данные, обработка которых осуществляется в целях, несовместимых между
          собой.
        </p>
        <p>
          4.4. Обработка только тех персональных данных, которые отвечают целям
          их обработки.
        </p>
        <p>
          4.5. Содержание и объем обрабатываемых персональных данных
          соответствуют заявленным целям обработки. Обрабатываются только те
          персональные данные, которые необходимы для достижения целей
          обработки.
        </p>
        <p>
          4.6. Обработка персональных данных, которые подлежат обязательному
          обезличиванию, осуществляется с учетом обязательного предварительного
          обезличивания персональных данных.
        </p>
        <p>4.7. Соблюдение целостности персональных данных при их обработке.</p>
        <p>
          4.8. Обработка персональных данных осуществляется с соблюдением
          принципов точности и достаточности персональных данных.
        </p>
        <p>
          4.9. Сохранение персональных данных не дольше, чем это требуется для
          целей обработки персональных данных, если иное не предусмотрено
          федеральным законом.
        </p>
        <p>
          4.10. Уничтожение персональных данных осуществляется по достижении
          целей их обработки или в случае утраты необходимости в достижении этих
          целей, а также при отзыве субъектом персональных данных согласия на
          обработку персональных данных, если иное не предусмотрено федеральным
          законом.
        </p>

        <h2>5. ЦЕЛИ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>

        <p>
          5.1. Оператор обрабатывает персональные данные субъектов персональных
          данных в следующих целях:
        </p>
        <ul>
          <li>
            предоставление услуг/возможностей, предлагаемых сайтом https://
            timeoneproject.com.com ;
          </li>
          <li>
            связь с Пользователем, включая направление уведомлений, запросов и
            информации, касающихся использования услуг/возможностей сайта, а
            также обработка запросов и заявок Пользователя;
          </li>
          <li>
            улучшение качества услуг/возможностей, предоставляемых сайтом.
          </li>
        </ul>

        <h2>6. УСЛОВИЯ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>

        <p>
          6.1. Обработка персональных данных субъектов персональных данных
          осуществляется на основе принципов:
        </p>
        <ul>
          <li>
            законности целей и способов обработки персональных данных и
            добросовестности;
          </li>
          <li>
            соответствия целей обработки персональных данных задачам,
            определенным при сборе персональных данных;
          </li>
          <li>
            соответствия объема и характера обрабатываемых персональных данных
            методам обработки персональных данных и целям обработки персональных
            данных;
          </li>
          <li>
            недопущения объединения баз данных, содержащих персональные данные,
            обработка которых осуществляется в целях, несовместимых между собой;
          </li>
          <li>
            соответствия содержания и объема обрабатываемых персональных данных
            заявленным целям обработки персональных данных;
          </li>
          <li>
            недопущения обработки персональных данных, несовместимой с целями
            обработки персональных данных;
          </li>
          <li>
            обеспечения точности, достаточности и актуальности персональных
            данных в отношении целей обработки персональных данных;
          </li>
          <li>
            недопущения хранения персональных данных дольше, чем это требуется
            для целей обработки персональных данных;
          </li>
          <li>
            обеспечения обязательного обезличивания персональных данных до их
            обработки в случаях, если обработка персональных данных без
            обезличивания необходима в целях, существенных для защиты жизни,
            здоровья, прав и законных интересов субъектов персональных данных
            или иных лиц;
          </li>
          <li>
            недопущения обработки персональных данных, относящихся к
            биометрическим персональным данным, без согласия субъекта
            персональных данных, за исключением случаев, предусмотренных
            федеральным законом;
          </li>
          <li>
            недопущения принятия решений, порождающих юридические последствия в
            отношении субъекта персональных данных или иным образом
            затрагивающих его права и законные интересы на основании
            исключительно автоматизированной обработки персональных данных;
          </li>
          <li>
            принятия всех необходимых организационных и правовых мер по
            обеспечению безопасности персональных данных от несанкционированного
            доступа к ним или их утраты или искажения, уничтожения или порчи.
          </li>
        </ul>

        <h2>7. ПРАВА СУБЪЕКТА ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>

        <p>7.1. Субъект персональных данных вправе:</p>
        <ul>
          <li>
            знать о источнике сбора персональных данных, их местонахождении,
            цели, сроках и способах обработки персональных данных, информации о
            лицах, которым передаются персональные данные, если доступ к такой
            информации не предусмотрен федеральными законами;
          </li>
          <li>
            получать информацию, касающуюся обработки его персональных данных,
            включая содержание исходного персонального данных, источник его
            получения, логику обработки персональных данных при их обработке с
            использованием средств автоматизации;
          </li>
          <li>
            уточнять, блокировать или уничтожать свои персональные данные в
            случае их неполно или не точности, необоснованности обработки данных
            или в случае незаконной обработки данных;
          </li>
          <li>
            требовать прекращения обработки своих персональных данных
            организацией или прекращения передачи данных третьим лицам;
          </li>
          <li>
            предъявлять возражения против обработки его персональных данных в
            целях маркетинга или иной массовой информации, а также вносить
            обоснованные требования о запрещении обработки своих персональных
            данных в случае нарушения закона.
          </li>
        </ul>

        <h2>8. ОТВЕТСТВЕННОСТЬ</h2>

        <p>
          8.1. Ответственность за невыполнение или ненадлежащее выполнение
          требований законодательства о персональных данных, включая настоящую
          Политику, возлагается на оператора, осуществляющего обработку
          персональных данных.
        </p>

        <p>
          8.2. В случае возникновения ущерба у субъекта персональных данных в
          результате неправомерной обработки его персональных данных, оператор
          обязан возместить ущерб в соответствии с законодательством Российской
          Федерации.
        </p>

        <h2>9. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ</h2>

        <p>
          9.1. Настоящая Политика является внутренним документом сайта https://
          timeoneproject.com.com и размещается в открытом доступе на сайте в
          сети Интернет.
        </p>

        <p>
          9.2. Оператор вправе вносить изменения в настоящую Политику без
          согласия субъектов персональных данных. Все изменения в Политике
          вступают в силу с момента их размещения на сайте https://
          timeoneproject.com.com .
        </p>

        <p>
          9.3. Пользователь самостоятельно отслеживает изменения в настоящей
          Политике, размещенной на сайте https:// timeoneproject.com.com .
        </p>

        <p>
          9.4. Настоящая Политика действует бессрочно до замены ее новой
          редакцией.
        </p>

        <p>Дата последнего обновления: 23 мая 2022 года.</p>
      </div>
    </Container>
  );
};

export default PrivacyPolicy;
