import Container from "@mui/material/Container";

const TermsConditions = () => {
  return (
    <Container>
      <h1>Условия и положения</h1>
      <p>Последнее обновление: 10 июня 2022 года</p>
      <p>
        Пожалуйста, внимательно ознакомьтесь с данными условиями и положениями
        перед использованием нашего сервиса.
      </p>
      <h1>Толкование и Определения</h1>
      <h2>Толкование</h2>
      <p>
        Слова, начинающиеся с заглавной буквы, имеют значения, определенные в
        следующих условиях. Нижеприведенные определения имеют одинаковое
        значение независимо от того, используются ли они в единственном или
        множественном числе.
      </p>
      <h2>Определения</h2>
      <p>Для целей данных условий и положений:</p>
      <ul>
        <li>
          <p>
            <strong>Филиал</strong> означает организацию, которая
            контролируется, контролирует или находится под общим контролем с
            другой стороной, где "контроль" означает владение 50% или более
            акций, долей участия или других ценных бумаг, дающих право голоса
            при выборе директоров или других управленческих органов.
          </p>
        </li>
        <li>
          <p>
            <strong>Страна</strong> относится к России.
          </p>
        </li>
        <li>
          <p>
            <strong>Компания</strong> (также называемая "Компания", "Мы", "Наш"
            или "Наши") относится к Prosecuritycourse.
          </p>
        </li>
        <li>
          <p>
            <strong>Устройство</strong> означает любое устройство, способное
            получить доступ к Сервису, такое как компьютер, мобильный телефон
            или планшет.
          </p>
        </li>
        <li>
          <p>
            <strong>Сервис</strong> относится к Веб-сайту.
          </p>
        </li>
        <li>
          <p>
            <strong>Сторонний сервис социальных медиа</strong> означает любые
            услуги или контент (включая данные, информацию, товары или услуги),
            предоставленные третьей стороной, которые могут быть отображены,
            включены или доступны через Сервис.
          </p>
        </li>
        <li>
          <p>
            <strong>Веб-сайт</strong> относится к Timeoneproject, доступному по
            адресу{" "}
            <a
              href=" timeoneproject.com"
              rel="external nofollow noopener"
              target="_blank">
              timeoneproject.com
            </a>
          </p>
        </li>
        <li>
          <p>
            <strong>Вы</strong> означаете физическое лицо, получающее доступ к
            Сервису или использующее его, а также компанию или другое
            юридическое лицо, от имени которого такое физическое лицо получает
            доступ к Сервису или использует его.
          </p>
        </li>
      </ul>
      <h1>Признание</h1>
      <p>
        Данные условия и положения регулируют использование данного Сервиса и
        соглашение между Вами и Компанией. Данные условия и положения определяют
        права и обязанности всех пользователей в отношении использования
        Сервиса.
      </p>
      <p>
        Ваш доступ к Сервису и использование его осуществляются на условии
        вашего принятия и соблюдения настоящих условий и положений. Настоящие
        условия и положения применяются ко всем посетителям, пользователям и
        другим лицам, получающим доступ к Сервису или использующим его.
      </p>
      <p>
        Получая доступ к Сервису или используя его, Вы соглашаетесь быть
        связанными данными условиями и положениями. Если Вы не согласны с любой
        частью данных условий и положений, Вы не можете получать доступ к
        Сервису.
      </p>
      <p>
        Вы заявляете, что вам исполнилось 18 лет. Компания не разрешает
        использование Сервиса лицам, не достигшим 18-летнего возраста.
      </p>
      <p>
        Ваш доступ к Сервису и использование его также зависят от вашего
        согласия и соблюдения Политики конфиденциальности Компании. Наша
        Политика конфиденциальности описывает наши политики и процедуры по
        сбору, использованию и раскрытию ваших персональных данных при
        использовании приложения или веб-сайта, а также информирует вас о ваших
        правах в отношении конфиденциальности и о том, как закон защищает вас.
        Пожалуйста, внимательно ознакомьтесь с нашей Политикой
        конфиденциальности перед использованием нашего Сервиса.
      </p>
      <h1>Ссылки на другие веб-сайты</h1>
      <p>
        Наш Сервис может содержать ссылки на веб-сайты или услуги третьих
        сторон, которые не контролируются Компанией.
      </p>
      <p>
        Компания не контролирует содержание, политику конфиденциальности или
        практику в отношении любых веб-сайтов или услуг третьих сторон. Вы также
        признаете и соглашаетесь с тем, что Компания не несет ответственности за
        любые убытки или ущерб, вызванные или якобы вызванные использованием или
        полаганием на любое такое содержимое, товары или услуги, доступные на
        или через любые такие веб-сайты или услуги третьих сторон.
      </p>
      <p>
        Мы настоятельно рекомендуем вам прочитать условия и положения и политику
        конфиденциальности любых веб-сайтов или услуг третьих сторон, которые вы
        посещаете.
      </p>
      <h1>Прекращение</h1>
      <p>
        Мы можем немедленно прекратить или приостановить ваш доступ, без
        предварительного уведомления или ответственности, по любой причине,
        включая, помимо прочего, нарушение вами данных условий и положений.
      </p>
      <p>
        По окончании срока действия вашего доступа ваше право на использование
        Сервиса немедленно прекращается.
      </p>
      <h1>Ограничение ответственности</h1>
      <p>
        Независимо от любого ущерба, который вы можете понести, полная
        ответственность Компании и ее поставщиков по любому положению данных
        условий и единственное обезвреживание всех вышеперечисленных событий
        ограничивается суммой, фактически уплаченной вами через Сервис или 100
        долларами США, если вы ничего не приобрели через Сервис.
      </p>
      <p>
        В максимально допустимой степени, предусмотренной применимым
        законодательством, в никаком случае Компания или ее поставщики не несут
        ответственности за какие-либо специальные, косвенные, непрямые или
        косвенные убытки (включая, но не ограничиваясь убытками от упущенной
        выгоды, потерей данных или иной информации, прерыванием деловой
        активности или иными денежными потерями), возникающие из использования
        или невозможности использования Сервиса или поставки или неиспользования
        данных услуг, даже если Компания была предупреждена о возможности таких
        убытков и несмотря на фактическую неэффективность основного
        обезвреживания.
      </p>
      <h1>Изменения условий и положений</h1>
      <p>
        Мы оставляем за собой право изменять или заменять данные условия и
        положения в любое время по нашему усмотрению. Если изменения
        материальны, мы предоставим вам уведомление не менее чем за 30 дней до
        вступления в силу новых условий. Что считать материальными изменениями
        будет определяться по нашему усмотрению.
      </p>
      <p>
        При использовании Сервиса после вступления в силу любых изменений данных
        условий и положений вы соглашаетесь с такими изменениями. Если вы не
        согласны с какими-либо изменениями данных условий и положений, вам
        необходимо прекратить использование Сервиса.
      </p>
      <h1>Связь</h1>
      <p>
        Если у вас возникли вопросы по поводу данных условий и положений,
        пожалуйста, свяжитесь с нами.
      </p>
      <li>
        Посетив эту страницу на нашем веб-сайте:{" "}
        <a
          href=" timeoneproject.com"
          rel="external nofollow noopener"
          target="_blank">
          timeoneproject.com
        </a>
      </li>
    </Container>
  );
};

export default TermsConditions;
